# -*- coding: utf-8 -*-
import json

# JSONデータの例（異なるキーを持つと仮定）
json_data = """
{
    "data": [
{"text": "@ny_b94x 女性枠を設けることと平等が結び付かないんですが\\n\\n女性枠を設けている所は女性に下駄履かせているので平等じゃないですよね\\nそれに対して貴方は男が下駄をはかされてきたと謎理論展開していたので\\n\\nじゃあその結果落とされた「可哀想な有能女性」とやらを貴方が雇ってやればよくない？という皮肉です", "conversation_id": "1727560325049024841", "edit_history_tweet_ids": ["1727575284935987280"], "id": "1727575284935987280", "in_reply_to_user_id": "1572542772263129090"}, 
{"text": "@Nebuka_rui 昨日の今日で皮肉ですねぇ…", "conversation_id": "1727571658016506190", "edit_history_tweet_ids": ["1727571811095982295"], "id": "1727571811095982295", "in_reply_to_user_id": "1360892314688778245"}, 
{"text": "もちろん皮肉ですよ！", "conversation_id": "1727559986203758929", "edit_history_tweet_ids": ["1727562215589605699"], "id": "1727562215589605699", "in_reply_to_user_id": "1144129438721855490"}, 
{"text": "@tira_tirarin 皮肉ですね", "conversation_id": "1727533869304594596", "edit_history_tweet_ids": ["1727539202869633104"], "id": "1727539202869633104", "in_reply_to_user_id": "4080039912"}, 
{"text": "@filter_123 国賓ですからぁ。\\n\\n皮肉です🤓", "conversation_id": "1727443313425580051", "edit_history_tweet_ids": ["1727530030207754505"], "id": "1727530030207754505", "in_reply_to_user_id": "934951192513282048"}, 
{"text": "@CDRVuwEf2d2fhc8 うまい皮肉ですねｗ", "conversation_id": "1726986475802329193", "edit_history_tweet_ids": ["1727522869272584497"], "id": "1727522869272584497", "in_reply_to_user_id": "1388098261739720707"}, 
{"text": "@4_kakeru_2__8 「それ、もしかして皮肉ですか？」とニコニコ笑い、\\n「きっと先生は、嫉妬とも上手く付き合えるのでしょう。愛から生まれる嫉み妬みはある種狂気ですし…」\\nもしかしなくともあの子ﾁｬﾝは概念アリス？(強めの幻覚)どんな風に仲良くなれるか既に楽しみです💋💋💋\\n「あら、そうでしたか」と言い、", "conversation_id": "1719543769144705442", "edit_history_tweet_ids": ["1727519668196499600"], "id": "1727519668196499600", "in_reply_to_user_id": "1654731390699851778"}, 
{"text": "@UAbbTlGF2g1yQqz @maeuso800 @jijicom えらく下手くそな皮肉ですね笑笑笑笑笑\\n結局都合悪いとまともな返しできないんですね\\n貴方の頭の程度がわかりました笑\\nご両親から素晴らしい教育を受けた んだなと思います", "conversation_id": "1726966800959820114", "edit_history_tweet_ids": ["1727516429426311664"], "id": "1727516429426311664", "in_reply_to_user_id": "1213443762493378560"}, 
{"text": "@ono_tomoya 皮肉ですねー。", "conversation_id": "1727513591644029294", "edit_history_tweet_ids": ["1727514626206863663"], "id": "1727514626206863663", "in_reply_to_user_id": "1268826206"}, 
{"text": "@kyo1110vv 傍若無人、自己中心で笑ってしまいましたwww\\nまんま林ですやんwww\\n唯一林に意見できたのがTAIJIだけだったのかもしれませんね。\\n林に脱退させられたTAIJIが、既に世界中のメタル界隈から大注目されていたメタルバンドLOUDNESSに加入したのが、何とも皮肉ですよねえ。", "conversation_id": "1727486675641937950", "edit_history_tweet_ids": ["1727514482505826662"], "id": "1727514482505826662", "in_reply_to_user_id": "265167076"}, 
{"text": "@napori_ankake 皮肉ですね。", "conversation_id": "1727500055391920290", "edit_history_tweet_ids": ["1727504604127166665"], "id": "1727504604127166665", "in_reply_to_user_id": "1210396823317147649"}, 
{"text": "@evomitsu180sx これが現状ですけどね\\n元ツイ、皮肉です", "conversation_id": "1727498114704220276", "edit_history_tweet_ids": ["1727501106643910882"], "id": "1727501106643910882", "in_reply_to_user_id": "2931086222"}, 
{"text": "@masahironishika ちゃうちゃう平和主義者送り込んだらお得意の平和外交(話し合い)で終わらせて来てくれるんですよね？と言う皮肉です。", "conversation_id": "1727219861124940036", "edit_history_tweet_ids": ["1727486397265915958"], "id": "1727486397265915958", "in_reply_to_user_id": "110938610"}, 
{"text": "@littlezeps 同じくです😭皮肉ですよね〜🥲とりあえず安全第一で頑張りましょう😑👍押忍🤣", "conversation_id": "1727479098686206349", "edit_history_tweet_ids": ["1727482504683417711"], "id": "17274825004683417711", "in_reply_to_user_id": "980703762590326784"}, 
{"text": "@chihauzu39 おはありですー！それはそれで皮肉ですよねーwww", "conversation_id": "1727448408255042028", "edit_history_tweet_ids": ["1727476433591931048"], "id": "1727476433591931048", "in_reply_to_user_id": "1134959701639090177"}, 
{"text": "@ABCp4Ever 子供の頃は意欲があったが実力と資金、両親からの規制が厳しくてできなかったとすれば、今は実力と資金、そして自由があるが体力 と意欲が足りなくてできないというのが本当に皮肉ですね。ㅜㅜ", "conversation_id": "1726837336753992175", "edit_history_tweet_ids": ["1727475175762133465"], "id": "1727475175762133465", "in_reply_to_user_id": "1487806312058552320"}, 
{"text": "@ShinHori1 すごい皮肉ですね。世襲議員を産んでいるのは、有権者なんですけどね、実態は。\\nまあ、政治資金団体の継承禁止くらいはやるべきと思うが。", "conversation_id": "1727267047783199064", "edit_history_tweet_ids": ["1727471234131411408"], "id": "1727471234131411408", "in_reply_to_user_id": "922316173923848197"}, 
{"text": "@ktsujino 「ここからはメモしないで」なんて口止めなんかしたらしいですが、バッチリ文字化されて拡散「はせ日記」なんてものもすっかり暴露されちゃって....言うに困って「発言は全て撤回します」発言は撤回できても事実までは撤回できません。\\nこれだけ不正を自ら表沙汰にしてくれて「お手柄」(皮肉ですが(笑)", "conversation_id": "1727454911091343725", "edit_history_tweet_ids": ["1727469241052618952"], "id": "1727469241052618952", "in_reply_to_user_id": "69966043"}, 
{"text": "@E_Fessenden これ皮肉ですね。", "conversation_id": "1727454307791106228", "edit_history_tweet_ids": ["1727455146429575643"], "id": "1727455146429575643", "in_reply_to_user_id": "541584081"}, 
{"text": "@ShinHori1 良い皮肉ですね。\\n\\nまぁ、本気で減らしたければ同一選挙区での多選の禁止が現実策ですかね。", "conversation_id": "1727267047783199064", "edit_history_tweet_ids": ["1727440790203539518"], "id": "1727440790203539518", "in_reply_to_user_id": "922316173923848197"}, 
{"text": "@boochaso1 皮肉ですよね？", "conversation_id": "1727391345973830100", "edit_history_tweet_ids": ["1727433638504198281"], "id": "1727433638504198281", "in_reply_to_user_id": "2907716653"}, 
{"text": "@nishimas 「公職選挙法に基づく選挙により当選しなければな らない」\\n\\n皮肉ですよ", "conversation_id": "1727356630411714764", "edit_history_tweet_ids": ["1727375575986377159"], "id": "1727375575986377159", "in_reply_to_user_id": "139325184"}, 
{"text": "@dead_san 皮肉ですよ", "conversation_id": "1727374465053696234", "edit_history_tweet_ids": ["1727375109651042330"], "id": "1727375109651042330", "in_reply_to_user_id": "110286684"}, 
{"text": "@gerogeroR 公平な選挙で受かったならそれで問題ないよね ！\\n国民に選ばれたんだから、世襲とか関係ないよね！\\n\\n……別に今と変わらないって皮肉ですね", "conversation_id": "1727361958968701362", "edit_history_tweet_ids": ["1727364394278166970"], "id": "1727364394278166970", "in_reply_to_user_id": "499524198"}, 
{"text": "@gerogeroR すんなり通じる人と通じない人がはっきり分かれそうな皮肉ですね", "conversation_id": "1727361958968701362", "edit_history_tweet_ids": ["1727363027216093442"], "id": "1727363027216093442", "in_reply_to_user_id": "499524198"}, 
{"text": "@osigaski_315 あれは遠回しな皮肉ですよwwww", "conversation_id": "1727318876193685947", "edit_history_tweet_ids": ["1727341388596191368"], "id": "1727341388596191368", "in_reply_to_user_id": "1229382176254283776"}, 
{"text": "@maa_nyaa だいぶ皮肉ですw", "conversation_id": "1727243593792799132", "edit_history_tweet_ids": ["1727335197203689822"], "id": "1727335197203689822", "in_reply_to_user_id": "1598406938567802880"}, 
{"text": "@DENKEN_HAL @nomisukebot @CMzDp2I4WF7Oujk @ns10110412 ・・・皮肉ですよ・・・。", "conversation_id": "1726241709468844446", "edit_history_tweet_ids": ["1727295455602860288"], "id": "1727295455602860288", "in_reply_to_user_id": "1686932434309521408"}, 
{"text": "@amisweetheart 日本には９条バリアと遺憾砲がありますからね。\\n正に無敵です。\\n\\n当然、皮肉です😑😑", "conversation_id": "1726996165839958397", "edit_history_tweet_ids": ["1727286379976253499"], "id": "1727286379976253499", "in_reply_to_user_id": "1192466437203361792"}, 
{"text": "@misatonakayama パソコンですらソフトやハードを更新するのに、ツイフェミはそれすらしませんからね😓(時代に取り残されているという皮肉です)", "conversation_id": "1727276752853254271", "edit_history_tweet_ids": ["1727280461108609459"], "id": "1727280461108609459", "in_reply_to_user_id": "187417708"}, 
{"text": "@tweetsoku1 もちろん皮肉ですよね？未熟なのはファンとマスコミ", "conversation_id": "1727178087782113665", "edit_history_tweet_ids": ["1727276574112940459"], "id": "1727276574112940459", "in_reply_to_user_id": "795188519115358208"}, 
{"text": "事務的に端的に対応したら無愛想と言われ、丁寧に対応したら慇懃無礼と言われるサイコーの職場なんだ（皮肉です）", "conversation_id": "1727272273659478114", "edit_history_tweet_ids": ["1727273087828435223"], "id": "1727273087828435223", "in_reply_to_user_id": "1692192328382087169"}, 
{"text": "@toshi23581755 え？\\n本気にしちゃいました？\\nもちろん皮肉ですよ？", "conversation_id": "1727238206478008333", "edit_history_tweet_ids": ["1727247884738056260"], "id": "1727247884738056260", "in_reply_to_user_id": "1320520431967715328"}, 
{"text": "@ALONSO914901 卑猥なのはメッシって皮肉ですか？\\nあの小物から、ホルモン剤抜いてみたら150代の本物小物ですよ笑笑\\n何を成し遂げようと、ドーピングがついてまわるからか。\\n普通に健常者とサッカー出来てるだけで感謝すべきなのに、あの性格あの態度と来たらドーピングネズミと呼ばれるに相応しい", "conversation_id": "1727225048971550839", "edit_history_tweet_ids": ["1727226085870649553"], "id": "1727226085870649553", "in_reply_to_user_id": "1502352861371727878"}, 
{"text": "@upinheavenmix クマの駆除くらいで大騒ぎする動物愛護団体とか（皮肉ですｗ", "conversation_id": "1726856564777381964", "edit_history_tweet_ids": ["1727224825981378562"], "id": "1727224825981378562", "in_reply_to_user_id": "156187897"}, 
{"text": "@Re_Riam 確かに。破壊環境って聞き ますね。\\nデブリキルモンされそう。\\nキャラ有りだと思いますが、このカード自体がギャラクタスメタという皮肉ですね", "conversation_id": "1727192339939233795", "edit_history_tweet_ids": ["1727199432356315354"], "id": "1727199432356315354", "in_reply_to_user_id": "1031463209209741312"}, 
{"text": "@Remyu100 @je16rEaZXA27612 法律家として、この方こそがしっかりと訴訟の流れとか界隈の人等にご説明してあげたら宜しいかと、その方が誉められて気分良くな るのにね～😂\\n (皮肉です)", "conversation_id": "1727143583243973074", "edit_history_tweet_ids": ["1727176993563922522"], "id": "1727176993563922522", "in_reply_to_user_id": "1582766533"}, 
{"text": "@OrcusYuta 皮肉です", "conversation_id": "1727140978908361053", "edit_history_tweet_ids": ["1727162629662327208"], "id": "1727162629662327208", "in_reply_to_user_id": "3107381720"}, 
{"text": "@toitosy 皮肉ですよw", "conversation_id": "1727152339289849880", "edit_history_tweet_ids": ["1727158096022450531"], "id": "1727158096022450531", "in_reply_to_user_id": "2836558370"}, 
{"text": "@Luxerio_Lock_on 僕なりのちょっとした皮肉ですよ\\nでもルクさんのその真面目なところ好きですよ\\nしかしまぁ真面目な話、ハクスラゲーは最強以下は全て雑魚という辛口な人もいますからね", "conversation_id": "1727123107444564099", "edit_history_tweet_ids": ["1727140592680153415"], "id": "1727140592680153415", "in_reply_to_user_id": "1445591347969204237"}, 
{"text": "@silence_kitten 個人エージェント契約になったというのが大きいですね\\n個人できた仕事は個人で\\nこの当たり前の状況がこんな時に叶うなんて皮肉ですね\\n個人仕事がG仕事 へスライドしていって悲しむ事も許されない世界が異常でした", "conversation_id": "1727100346017984665", "edit_history_tweet_ids": ["1727135665031389675"], "id": "1727135665031389675", "in_reply_to_user_id": "1130836584"}, 
{"text": "@Hayashi21yoko 維新の吉村知事\\nホンマは万博関係者（万博協会副会長）\\n\\nそやけど本人は万博関係者やと思うとらへん\\n\\nその証拠に\\n\\n副会長務める万博協会の担当者に「公開質問」\\n\\n自分は万博関係者やという自覚がない\\n\\n皮肉です", "conversation_id": "1727084775452852289", "edit_history_tweet_ids": ["1727131910064001143"], "id": "1727131910064001143", "in_reply_to_user_id": "1542686907963801600"}, 
{"text": "@LOBBSBY です🥰🥰\\nジム爺は 強烈な皮肉ですね🤣🤣", "conversation_id": "1727124587450876256", "edit_history_tweet_ids": ["1727131428234867005"], "id": "1727131428234867005", "in_reply_to_user_id": "559507743"}, 
{"text": "@MuneoJPN @takigare3 国の現 状と民主主義の選挙の結果としてこの大統領。つまり教育の結果としての大統領がいらんと言うならいらんのでしょう。皮肉ですね。", "conversation_id": "1726768760751841432", "edit_history_tweet_ids": ["1727112141558395189"], "id": "1727112141558395189", "in_reply_to_user_id": "76669241"}, 
{"text": "@RaNoJi_JB 客も豚デザインにするのめっちゃ皮肉ですよね！？賭け金も元はVIPの金だからわからなくはないですが！", "conversation_id": "1727078223241167139", "edit_history_tweet_ids": ["1727090107210211653"], "id": "1727090107210211653", "in_reply_to_user_id": "1438087083738877952"}, 
{"text": "@ohtsubakiyuko @Sankei_news まさに「注意をしただけでも差別と取られるのではないか 」という国民の不安を、「女性の安全安心の議論をすべきという意見もヘイトと取られる可能性もある」と、実際に見せていただいてありがとうございます（皮肉ですよ）\\n\\nマイノリティを守るためにマジョリティを犠牲にしていいはずなくないですか？", "conversation_id": "1726560822229602403", "edit_history_tweet_ids": ["1727086529489834085"], "id": "1727086529489834085", "in_reply_to_user_id": "1114155329132974080"}, 
{"text": "@sioagisoluto @N25UIDZZ 理論から外れた検証実験で「悪魔の種よ去れ！」をやっていたメンデルの名が付いている皮肉ですね", "conversation_id": "1726959560769106180", "edit_history_tweet_ids": ["1727066235328921761"], "id": "1727066235328921761", "in_reply_to_user_id": "2290744728"}, 
{"text": "@hachi64418802 皮肉ですねぇ…", "conversation_id": "1726979673270493346", "edit_history_tweet_ids": ["1726986292699992159"], "id": "1726986292699992159", "in_reply_to_user_id": "1478333468635725824"}, 
{"text": "しかも、駅長が出したもの、としている事から記事の内容が正しければ、jアラートが鳴った後に駅長に確認をとって文章を考え、入力をし、体裁を整え、約10分ほどであの案内文を出しているわけか。\\n\\nすげぇ優秀だ。\\n\\n一方で那覇空港ではどんな対応を取ったんだろうか？\\n\\n※皮肉です", "conversation_id": "1726971172297019829", "edit_history_tweet_ids": ["1726972461244379502"], "id": "1726972461244379502", "in_reply_to_user_id": "155179154"}, 
{"text": "@misakifes1 機関車を持っていても、どちらも政党内で牽引役になれないというのもまた皮肉です。。。", "conversation_id": "1726966069095723372", "edit_history_tweet_ids": ["1726969910826586570"], "id": "1726969910826586570", "in_reply_to_user_id": "1081879444216700928"}, 
{"text": "@bakanihakaten35 ナイスな皮肉です🤣", "conversation_id": "1726886579057353176", "edit_history_tweet_ids": ["1726967244553687235"], "id": "1726967244553687235", "in_reply_to_user_id": "3859287678"}, 
{"text": "@kidasangyo これは痛烈な皮肉ですね…\\nしかしこの給食は酷い…", "conversation_id": "1726892768008790355", "edit_history_tweet_ids": ["1726964465697218696"], "id": "1726964465697218696", "in_reply_to_user_id": "158703197"}, 
{"text": "@stake0000000 @sai80kazu ニコニコのり。。。\\n皮肉ですね。笑", "conversation_id": "1726955522501542226", "edit_history_tweet_ids": ["1726960211662193125"], "id": "1726960211662193125", "in_reply_to_user_id": "1572926694885068801"}, 
{"text": "@0120441222r でもみんな一つのことに全力を注いで死ねたという点で、エッジランナーズの世界では最高のハッピーエンドかもしれません。皮肉ですよね😭", "conversation_id": "1726854994564100532", "edit_history_tweet_ids": ["1726959039245094936"], "id": "1726959039245094936", "in_reply_to_user_id": "1430942572550053890"}, 
{"text": "@vocal_range な るほど！👀\\n公共交通機関が充実すれば…事故は減る…\\n\\nそう考えると皮肉ですね。\\n新規の人口は減っていく…\\n本来は（あなた方は公共交通機関使おうよ…）という高齢者は自家用車乗りたがる…\\nで都市部以外の公共交通機関は採算取れず減 っていく…", "conversation_id": "1726936950035353684", "edit_history_tweet_ids": ["1726953107794612657"], "id": "1726953107794612657", "in_reply_to_user_id": "1235229196521058305"}, 
{"text": "@83xk6 これ皮肉ですよ。\\nあと痴漢も犯罪です…。", "conversation_id": "1726881650632802435", "edit_history_tweet_ids": ["1726951786827981290"], "id": "1726951786827981290", "in_reply_to_user_id": "1453746942509416453"}, 
{"text": "@qbgzlV4jfeY4B9G @tojibuta_san @ssei95322655 「嫌味」とか「皮肉」ですって自分で解説するの、俺は恥ずかしくて出来んわ…。", "conversation_id": "1725717543732838789", "edit_history_tweet_ids": ["1726942111273222647"], "id": "1726942111273222647", "in_reply_to_user_id": "1591674148258222080"}, 
{"text": "皮肉です。", "conversation_id": "1726941602864910438", "edit_history_tweet_ids": ["1726941693222834448"], "id": "1726941693222834448", "in_reply_to_user_id": "255940842"}, 
{"text": "@7seananami 皮肉です。", "conversation_id": "1726921936566125005", "edit_history_tweet_ids": ["1726931322986451380"], "id": "1726931322986451380", "in_reply_to_user_id": "916925090704408576"}, 
{"text": "@shizuku202306 愛があっても\\n愛は貰えません…\\n\\n皮肉ですわ🥲", "conversation_id": "1726888499763450082", "edit_history_tweet_ids": ["1726912881575555461"], "id": "1726912881575555461", "in_reply_to_user_id": "16648100997788594176"}, 
{"text": "@TANAKA_Kei 公立脱洗脳監禁機関\\nリハビリと称して次の #拉致監禁 #強制改宗 を手助けさせる変な #脱会専門家 より良いかもしれない\\n＊皮肉です", "conversation_id": "1726763038358032601", "edit_history_tweet_ids": ["1726912704060014625"], "id": "1726912704060014625", "in_reply_to_user_id": "96762516"}, 
{"text": "@you_you_yui 下手ですワタシ\\n皮肉ですか\\nキャリーしてくださいゆ〜さん！", "conversation_id": "1726889805622251822", "edit_history_tweet_ids": ["1726910997527699457"], "id": "1726910997527699457", "in_reply_to_user_id": "1726515104802648064"}, 
{"text": "@kametatanu56733 そうですね。知ろうとしなかった。目先の金に目が眩んだ。○人的な行為をしてきて儲けた医者はかなり居るはずですよ。でも因果関係を不明にできるのも医者。\\n皮肉です。", "conversation_id": "1726542050517254423", "edit_history_tweet_ids": ["1726903256130175217"], "id": "1726903256130175217", "in_reply_to_user_id": "1681787603698483202"}, 
{"text": "@you_cook_rubbit これは池内先生を攻撃している人達の中に池内先生の事を「外務省のポチ」「マスゴミの御用学者」等の侮辱をする人がいるが、政府やメディアの使う「ハマス」表記をしていない自分はそうじゃない証明になるでしょ、という半ば皮肉ですよ。そう読み取れないのなら、それは日本語の読解能力の問題です。", "conversation_id": "1726896163109110225", "edit_history_tweet_ids": ["1726901879484174723"], "id": "1726901879484174723", "in_reply_to_user_id": "1102093074283454467"}, 
{"text": "@KIRIMOCHY 制度を推進する立場からは「益税」を掲げて「減らすんだ」という方が「正義感」喚起できて都合がいいんじゃないでし ょうか(皮肉ですが、実際それを利用して推進されてるのだと思います)。", "conversation_id": "1726822826743898257", "edit_history_tweet_ids": ["1726896457716998412"], "id": "1726896457716998412", "in_reply_to_user_id": "94332157"}, 
{"text": "@kasokusurupulse 太鼓メインでTwitterやってる中高生で猫化してるようなやつが他人に存在価値ないって言ってるからですね\\n当然ながら皮肉です\\n優しいので障害者雇用枠とは言いませんでした", "conversation_id": "1726851225398940023", "edit_history_tweet_ids": ["1726885808425353311"], "id": "1726885808425353311", "in_reply_to_user_id": "1444532461757599746"}, 
{"text": "つまるとこ、「お金持ちな老人に搾取される俺たちによる革命」みた いな理屈なので、新自由主義に見える共産主義みたいな話だったりします。色々皮肉ですね。", "conversation_id": "1726864149249233043", "edit_history_tweet_ids": ["1726866119900946919"], "id": "1726866119900946919", "in_reply_to_user_id": "476671982"}, 
{"text": "@umetane1 何が起こるかというと、スタジオは独自のモンスターを使った別の映画を作りたかったので、ここでジラが誕生しましたが、それを売るためにタイトルにゴジラを入れました（皮肉です）", "conversation_id": "1726838633733537908", "edit_history_tweet_ids": ["1726862564305637399"], "id": "1726862564305637399", "in_reply_to_user_id": "724099116993662976"}, 
{"text": "皮肉です", "conversation_id": "1726812921911787964", "edit_history_tweet_ids": ["1726833851870466195"], "id": "1726833851870466195", "in_reply_to_user_id": "1427582048005287936"}, 
{"text": "@kumonosumika 皮肉ですね。", "conversation_id": "1726823907309785391", "edit_history_tweet_ids": ["1726824833353482244"], "id": "1726824833353482244", "in_reply_to_user_id": "123975430"}, 
{"text": "@orotida あー、最初のやつは昔ハングル板で流行った皮肉ですわ。\\n\\n「ことの正誤に関わらず、都合の悪いことは対象には差別(シャベツ)にしか聞こえない(から決して反省も改善もない。むしろ逆ギレするから気をつけろ)」という格言ですわ。\\n\\nそれは別にあそこだけに限った話しではないと言うこと。", "conversation_id": "1726800953712705938", "edit_history_tweet_ids": ["1726811090838028483"], "id": "1726811090838028483", "in_reply_to_user_id": "839718752530808833"}, 
{"text": "わかってない人多いかもだから一応言うと皮肉ですが", "conversation_id": "1726767545209032763", "edit_history_tweet_ids": ["1726810523424215495"], "id": "1726810523424215495", "in_reply_to_user_id": "941114424663801857"}, 
{"text": "@KitutuKi_917 皮肉ですよ(なんてったって私は「美しい国」なんて宣う人 たちが大嫌いですから)", "conversation_id": "1726610333786345899", "edit_history_tweet_ids": ["1726810009777135943"], "id": "1726810009777135943", "in_reply_to_user_id": "594252259"},
{"text": "@Tori_no_kenja これを店舗などで売り出すとマスクを付けた人達が殺到して、食べに来ますね。\\n\\nただ、食べる時にマスクを外すのもまた皮肉ですね。", "id": "1726741843084443667", "conversation_id": "1726405120987119822", "edit_history_tweet_ids": ["1726741843084443667"], "in_reply_to_user_id": "1352875966201176064"}, 
{"text": "@sugi06429011 私も詳しくはありません。農業を扱う外資系もあるよね、程度の認識です。\\n\\nコンサルや外資系の方がカッコイイと言うポストに対する皮肉です。", "id": "1726738251111891264", "conversation_id": "1726435201952448749", "edit_history_tweet_ids": ["1726738251111891264"], "in_reply_to_user_id": "1037324135427264512"}, 
{"text": "@Haiiro_2790 自分が行うことで犯罪増やしてるだけというのは本当に皮肉ですよね", "id": "1726729984314933571", "conversation_id": "1726728064305156593", "edit_history_tweet_ids": ["1726729984314933571"], "in_reply_to_user_id": "1479393902948134920"}, 
{"text": "@ProfShimada これは例の島田先生のマスコミに対する皮肉ですね。", "id": "1726648402895831457", "conversation_id": "1726001646357164157", "edit_history_tweet_ids": ["1726648402895831457"], "in_reply_to_user_id": "130544832"}, 
{"text": "@shibabi77 皮肉ですが、病気によってお嫁に行かなくてよくなり。独身だけど生涯好きな事ができた人生。悪くないかもですね✨同時は政略結婚が多かったでしょうから。", "id": "1726647782440866287", "conversation_id": "1726344703308939499", "edit_history_tweet_ids": ["1726647782440866287"], "in_reply_to_user_id": "1633044443292106753"}, 
{"text": "@popop02101718 反省してないとか結構いちゃもんつけられてますよー、\\nあとこれは馬鹿達がまたなんか言ってるから反省してあげてね(笑)という皮肉です", "id": "1726623639997698106", "conversation_id": "1726450788967555209", "edit_history_tweet_ids": ["1726623639997698106"], "in_reply_to_user_id": "1703204365916647424"}, 
{"text": "@Kael_Home それはありますね。なにより最大ヒット曲のTomorrow never knowsが1番合わないという皮肉ですね。 アルバムmixもあまり好きじゃないという。笑", "id": "1726619912884662664", "conversation_id": "1726615282419126782", "edit_history_tweet_ids": ["1726619912884662664"], "in_reply_to_user_id": "1281292066014687232"}, 
{"text": "@No373O4 だとしたら皮肉ですよね\\nサル「やっぱワシが正しかった んじゃん」になる面があるので…(海外進出)", "id": "1726605478690754562", "conversation_id": "1726605089702568378", "edit_history_tweet_ids": ["1726605478690754562"], "in_reply_to_user_id": "1279660638"}, 
{"text": "@sentineeellll それを頭で知ってても医者は分かってないんじゃないかという皮肉です", "id": "1726603551051542614", "conversation_id": "1726248897562182078", "edit_history_tweet_ids": ["1726603551051542614"], "in_reply_to_user_id": "1352971298520010752"}, 
{"text": "@creamyblog わかります！うんこの方がうまいとか知ってる人からすると最高に皮肉ですしね笑", "id": "1726600997823529280", "conversation_id": "1726449535134917034", "edit_history_tweet_ids": ["1726600997823529280"], "in_reply_to_user_id": "610078928"}, 
{"text": "@IngABCLkygT0mWm ぱちんこ先バレ15k分回しても来ないのに\\nスロットレババレ1kで来るの皮肉ですか？", "id": "1726594438494036202", "conversation_id": "1726592358509396010", "edit_history_tweet_ids": ["1726594438494036202"], "in_reply_to_user_id": "1559024832851091457"}, 
{"text": "@korosama 皮肉ですね\\n魚類が子孫のために流れを読んで川を登っていくよう\\n人間の弁護士ではなかったのですね", "id": "1726593763534135635", "conversation_id": "1725394082875482474", "edit_history_tweet_ids": ["1726593763534135635"], "in_reply_to_user_id": "74548534"}, 
{"text": "@77iHDMYOGxTiv0V 本気にしないで、皮肉ですから😉", "id": "1726588193364222379", "conversation_id": "1726577356889076035", "edit_history_tweet_ids": ["1726588193364222379"], "in_reply_to_user_id": "1492275559002345474"}, 
{"text": "まあ世の中に100％ はあり得ませんからね。\\n\\n「自分のやっている金融業が信用第一と自覚していながら、なお自らの職業に寸毫の矜持も持ち合わせていない」金融屋なら、ひょっとして言えるのかも知れません。\\n\\nええ、もちろん皮肉ですよ", "id": "1726584413419643046", "conversation_id": "1726580828367716502", "edit_history_tweet_ids": ["1726584413419643046"], "in_reply_to_user_id": "2421645811"}, 
{"text": "@Bonjour4145 …それは…何といいますか…豚肉ですか？\\nじゃなかった、鶏肉ですか\\nちゃうちゃう、牛肉ですか(いい加減にしろ👊)\\n\\n皮肉ですよね、間違いなくwww", "id": "1726582950777716817", "conversation_id": "1726516846160191530", "edit_history_tweet_ids": ["1726582950777716817"], "in_reply_to_user_id": "1155322878776107008"}, 
{"text": "さすがに皮肉ですが()", "id": "1726582113775092174", "conversation_id": "1726581907255648639", "edit_history_tweet_ids": ["1726582113775092174"], "in_reply_to_user_id": "1198179064915189765"}, 
{"text": "@alrnyd コンテナやばいｗｗｗｗｗｗｗｗｗｗｗｗｗｗｗｗｗｗｗｗド◯ーマーズ(笑)はお荷物っていう皮肉ですか？前日とか当日とか全然ドタキャンしてもらって構わないので！笑\\nよければ行きましょ👍🏻💖", "id": "1726575289655058600", "conversation_id": "1726571123062739390", "edit_history_tweet_ids": ["1726575289655058600"], "in_reply_to_user_id": "1262211215096344576"}, 
{"text": "@mk_nomask @momo61117806 人口削減の成果にウクライナに勝ちましたね、うまい対応です(勿論皮肉です)", "id": "1726527531552248281", "conversation_id": "1726250196152336866", "edit_history_tweet_ids": ["1726527531552248281"], "in_reply_to_user_id": "1579658751920832517"}, 
{"text": "@chiyo1986 なかなか皮肉ですよね。実は自分が避けた治安の悪い学校、生徒の人数がどんどん減っていった代わりに少人数学級になってるみたいで返って手厚いとかいう評判を聞きます。噂なのでなんともですけど、一時すごく悪かった評判が段々マシになってるという感じで。", "id": "1726522590871933335", "conversation_id": "1726407037360464139", "edit_history_tweet_ids": ["1726522590871933335"], "in_reply_to_user_id": "3293774886"}, 
{"text": "@SF8jCo9NqbPGCSS えーと、皮肉です……", "id": "1726511818519249314", "conversation_id": "1726480622494040065", "edit_history_tweet_ids": ["1726511818519249314"], "in_reply_to_user_id": "1457201209123950593"}, 
{"text": "@suigetutyou ホロコーストの被害者が作った国でその先祖達が民族浄化に加担してるのホント皮肉ですねぇ…\\n\\n自分もハマスは許すべきではないと思いますね。\\nただ、ハマスが支持されてしまう地盤を作った原因は明らかにイスラエルの入植政策などにあると思います。", "id": "1726505626279567447", "conversation_id": "1726503444671033785", "edit_history_tweet_ids": ["1726505626279567447"], "in_reply_to_user_id": "1354543854"}, 
{"text": "@hidejazz ｗｗｗ\\n\\n決して誤用ではなく皮肉ですｗｗ", "id": "1726501317068329055", "conversation_id": "1726500894941106590", "edit_history_tweet_ids": ["1726501317068329055"], "in_reply_to_user_id": "177863044"}, 
{"text": "@apricot_candy_a 産後実母に手伝いに来てもらったんですが、実母が夫に気遣って、お産に5日かかった私に、\\n起きて夫に朝ごはん準備したらどー？\\nみたいな感じで起 こしてきて、半強制的にやらされたの思い出しました。実母ですらそんなんですから、なんか皮肉です。二人目は夫が学んでくれたようで動いてくれましたよ！", "id": "1726481358464385464", "conversation_id": "1726213721650004388", "edit_history_tweet_ids": ["1726481358464385464"], "in_reply_to_user_id": "858596259195633664"}, 
{"text": "@omizu_mo リスナー呼びって前からでしたっけ！？ちょっとあれれ〜〜？？😲ってなってます！！仮にいんふるえんさーの事を 大道芸人って言ってるならすごく皮肉ですね🍖", "id": "1726476586822807574", "conversation_id": "1726457549405479402", "edit_history_tweet_ids": ["1726476586822807574"], "in_reply_to_user_id": "1498572930027954176"}, 
{"text": "@6AuxH8DUSVxkMat ですよね。面白い改変してきたなーと思いました☺️セフィ様もまさか、自分が全くの善意で放った何気ない言葉がクラにとってここまで響いたとは思ってなかったかもですよね。この言葉が不安定なクラの心の拠り所のよ  うになったのも、その後の流れを見るとある意味皮肉です。", "id": "1726475786100879712", "conversation_id": "1726453978958115024", "edit_history_tweet_ids": ["1726475786100879712"], "in_reply_to_user_id": "1626443463498797056"}, 
{"text": "@KuaiKuaiX いや・・・行かなくとも理解できますよ。私が書きたいのは、チャットが全て正しいなど微塵も思ってなどいませんよ。一般論でもアイヌが民族でも先住民でもない事が明らかなのに日本の政治は逆を向くのかという皮肉です。", "id": "1726465168522252667", "conversation_id": "1726462418157793585", "edit_history_tweet_ids": ["1726465168522252667"], "in_reply_to_user_id": "1715173722863370240"}, 
{"text": "@look695luminar @renho_sha 内閣に対する皮肉ですか？", "id": "1726458617782804559", "conversation_id": "1726365077761388820", "edit_history_tweet_ids": ["1726458617782804559"], "in_reply_to_user_id": "986688936"}, 
{"text": "@yuruhuwa_kdenpa コロアキが\\n鬼になるのを最後まで拒んで、\\n最期を笑顔で迎えた\\n煉獄杏寿郎の服装をしていたのは\\n本当に皮肉ですね。\\n\\n煉獄さんが鬼になった世界線ですね。\\n動画みようと思っても、\\nほとんど消されてましたが。", "id": "1726433966398513209", "conversation_id": "1726242883513332044", "edit_history_tweet_ids": ["1726433966398513209"], "in_reply_to_user_id": "201969770"}, 
{"text": "@KThawest 「どうせ天国行ったんだろ！現世より良いところ確定なんだから良いじゃん！皮肉ですか！？皮肉なんですか！？羨ましい以外出てこないんですけど！！」", "id": "1726429270443282531", "conversation_id": "1726207451329081824", "edit_history_tweet_ids": ["1726429270443282531"], "in_reply_to_user_id": "1136482537981636608"}, 
{"text": "@like_pulp なにかと言うとすぐYouTubeの自分のチャンネルでカネにしようとする百田先生への痛烈な皮肉ですかね？\\n\\nYouTubeで安倍さんの訃報をフライングしたり、街頭演説の不備で解散させら れた時もYouTubeに誘導したり。\\n\\nカネもらうなんて汚いですよね！", "id": "1726428747111538911", "conversation_id": "1726418207827992668", "edit_history_tweet_ids": ["1726428747111538911"], "in_reply_to_user_id": "1591614386484916224"}, 
{"text": "@inari_oji 『リベラル』が弾圧や妨害（と、たまに暴力や違法行為）で論敵を黙らせ従わせようとする一方で、保守は反対意見も含めて言論の『自由』を尊重する。\\nグロテスクな皮肉ですね。\\n\\nアイツらはリベラルでも、活動家ですらもなく、プチ・ファシストかカルトの教祖を目指してるみたい。\\n\\n拗らせ承認要求家？", "id": "1726408003493261409", "conversation_id": "1726395009363218713", "edit_history_tweet_ids": ["1726408003493261409"], "in_reply_to_user_id": "2194211701"}, 
{"text": "@swim_shu 皮肉ですね。", "id": "1726393341976383994", "conversation_id": "1725720155727298891", "edit_history_tweet_ids": ["1726393341976383994"], "in_reply_to_user_id": "2968468362"}, 
{"text": "@ai_cinema_ 「お前愛と信仰の力って素晴らしいって顔してんじゃねーよﾊﾟｰﾝ」ってなりますよ。あのラスト完全に皮肉ですよね\\n\\n反宗教映画だし愛って綺麗事だけじゃねーよって映画でもあると思います。ベスの友達の「地獄に行くかどうかお前らが決めてんじゃねえよ」にひたすら首肯です", "id": "1726384034710995379", "conversation_id": "1726079343150104996", "edit_history_tweet_ids": ["1726384034710995379"], "in_reply_to_user_id": "1227141996474585090"}, 
{"text": "@y_210na @takigare3 ヤバい奴等に男女の差はなく平等。\\n今の世の中、男女平等って良く言われてますけど、何とも言えない皮肉です…\\nあ、FF外から失礼を致しましたm(_ _)m", "id": "1726325283790503979", "conversation_id": "1726036413928595632", "edit_history_tweet_ids": ["1726325283790503979"], "in_reply_to_user_id": "136924014"}, 
{"text": "睡眠薬のベンゾをやめたらぐっすり眠れるようになるとか、皮肉ですね。", "id": "1726310148145389708", "conversation_id": "1726305788036284505", "edit_history_tweet_ids": ["1726310148145389708"], "in_reply_to_user_id": "1317325201420382208"}, 
{"text": "@nishy03 真面目な皮肉ですね （笑笑）\\n大人な対応なので一敬します。", "id": "1726301815074078724", "conversation_id": "1726258298985554222", "edit_history_tweet_ids": ["1726301815074078724"], "in_reply_to_user_id": "137867936"}, 
{"text": "@bell_mark_ @imakita 皮肉、ですかね……", "id": "1726259798818365898", "conversation_id": "1726257818922307976", "edit_history_tweet_ids": ["1726259798818365898"], "in_reply_to_user_id": "93630867"}, 
{"text": "@StainEditor 確かに多 分皮肉ですね、\\nそこまでリプ見てないのに勝手なこと言ってすみません こんなの気にしないで頑張ってくださいね！", "id": "1726252569515958641", "conversation_id": "1726232668915032230", "edit_history_tweet_ids": ["1726252569515958641"], "in_reply_to_user_id": "1451245290229407745"}, 
{"text": "@ProfShimada 皮肉ですよね？？徹底追求・野党は内閣不信任案まで行けば清廉ですが、池田先生の美辞麗句を奉るのが目に見えています。うちの家はアンチ創価なので、自民はさよならになりました。", "id": "1726243230889759198", "conversation_id": "1726001646357164157", "edit_history_tweet_ids": ["1726243230889759198"], "in_reply_to_user_id": "130544832"}, 
{"text": "@66_thevisionary  皮肉です", "id": "1726237024770994596", "conversation_id": "1725899104478462140", "edit_history_tweet_ids": ["1726237024770994596"], "in_reply_to_user_id": "1713403227742564352"}, 
{"text": "@tanedadayo0712 幸い大丈夫ですｗｗｗ\\n（あの騒動皮肉ですけど確実にマフィンの売上を伸ばしてると思う…）", "id": "1726214595763994714", "conversation_id": "1726207932365492264", "edit_history_tweet_ids": ["1726214595763994714"], "in_reply_to_user_id": "582783817"}, 
{"text": "@ndldnjaem 確かにブーメランです。\\nしかも、長年、羽生さんを誹謗中傷してきた一般人も沢山いるんですが、多くは次号の特集にいるスケーターのファンですね。\\n凄い皮肉です。", "id": "1726205955933982885", "conversation_id": "1726189076213379307", "edit_history_tweet_ids": ["1726205955933982885"], "in_reply_to_user_id": "1314401785625276416"}, 
{"text": "一応言っておくと皮肉です。", "id": "1726192320494829927", "conversation_id": "1726192315990200331", "edit_history_tweet_ids": ["1726192320494829927"], "in_reply_to_user_id": "2583929030"}, 
{"text": "@castratioprintf 長寿化が高齢化社会を助長して国の衰退につながるなんて皮肉ですね", "id": "1726183788693360995", "conversation_id": "1726182750347252048", "edit_history_tweet_ids": ["1726183788693360995"], "in_reply_to_user_id": "2334998630"}, 
{"text": "@hitsumabushi_wk 卑しき投機クラスタやギャンブルクラスタのほうがKYCの概念には詳しいというのがなんとも皮肉です。\\nというかKYCという用語すらご存じない可能性も。\\n\\n（我々ですら知ってても用いない用語って沢山あるのに・・・。）", "id": "1726180370281070830", "conversation_id": "1726174207711863246", "edit_history_tweet_ids": ["1726180370281070830"], "in_reply_to_user_id": "1648588651482480640"}, 
{"text": "@dori_disney 皮肉です〜^^", "id": "1726149708341723376", "conversation_id": "1726149410021900521", "edit_history_tweet_ids": ["1726149708341723376"], "in_reply_to_user_id": "1595914880632356865"}, 
{"text": "@spriggan_wiser 電話や画面上でやりとりするのと実際に会うのではコミュニケーションのインセンティブが全然違うと 言うのはわかるんですが、それを乗り越えるのがテクノロジーなのでは…と言う皮肉ですかね。", "id": "1726125930828226885", "conversation_id": "1726089943926423677", "edit_history_tweet_ids": ["1726125930828226885"], "in_reply_to_user_id": "91564927"}, 
{"text": "@tamashin40_c すごい皮肉ですね…😅", "id": "1726113005468094668", "conversation_id": "1726060229237068096", "edit_history_tweet_ids": ["1726113005468094668"], "in_reply_to_user_id": "1331403066113835008"}, 
{"text": "@Kawasemachi_BC 言いにくい事、最初に誰かが言ったらばんばん続くようなお話ですよね。ギリまで続くかなと。\\n皮肉ですね、一体誰の為なんだか。", "id": "1726102097454928298", "conversation_id": "1726025287958479049", "edit_history_tweet_ids": ["1726102097454928298"], "in_reply_to_user_id": "1142409151206707202"}, 
{"text": "@h_yuzuki 先生にしては珍しい皮肉ですねw\\n面白いけど。", "id": "1726096431793181013", "conversation_id": "1726032375908540457", "edit_history_tweet_ids": ["1726096431793181013"], "in_reply_to_user_id": "474868617"}, 
{"text": "@MwVjulOR9RA6fqQ いや、それは知ってますw\\n出たいイベントだけ出れるとかそんな甘い世界じゃないんじゃないのか。っていう皮肉です。", "id": "1726088363646791680", "conversation_id": "1726086791969775780", "edit_history_tweet_ids": ["1726088363646791680"], "in_reply_to_user_id": "790129102879543296"}, 
{"text": "@yz8RZ9rjsdTGl8T それって皮肉ですか？\\n夜10時過ぎるから1泊しました。\\nその日を最後にHクリニックは行ってません。\\nだって治らないんだから。\\nHクリニックから離れたらたった4ヶ月で治りました。\\n是非お試し下さい😊", "id": "1726081735149166656", "conversation_id": "1725779848512299305", "edit_history_tweet_ids": ["1726081735149166656"], "in_reply_to_user_id": "1615268983313432577"}, 
{"text": "ミスコンとヒロインレース。どちらも遅れて参加してきた綾華。ミスコンは勝ったが、恋愛では負けてしまったのがまた皮肉ですな。\\n礼奈が悠太と別れるきっかけになった男子がまた登場しましたが、マジでボコボコにしていいと思います。人の恋愛めちゃくちゃにしておいて自分は女の子つれて↓", "id": "1726080402148982969", "conversation_id": "1726080276638626092", "edit_history_tweet_ids": ["1726080402148982969"], "in_reply_to_user_id": "1297771623311843328"}, 
{"text": "@sharenewsjapan1 自分の任期の間にやれることはやっておこうという気概を感じますね。\\n\\nいや、皮肉ですよ😑", "id": "1726073955210162366", "conversation_id": "1725833596366450972", "edit_history_tweet_ids": ["1726073955210162366"], "in_reply_to_user_id": "1161186227279654912"}, 
{"text": "@binbou415 もうネタですよね？\\n普通にワクチン打ってる人から子ども産まれてますもんね。\\nこういう根拠ない情報に振り回されてはいけないって皮肉ですよね。", "id": "1726073234058264918", "conversation_id": "1725809817095397492", "edit_history_tweet_ids": ["1726073234058264918"], "in_reply_to_user_id": "293350959"}, 
{"text": "@buttigirenissan リプ欄で「どっちの方が危ない」とかいう論争が繰り広げられてるので言わせてもらいますが、僕が言ったのは「どっちが危ない」とかいう話じゃなくて、「改造車は免停」っていう案は「老人は免停」っていうのと同じくらい考えなしな話しだよっていう皮肉ですので\\n\\n筋違いなレスバ繰り広げないで下さい", "id": "1726068368271380508", "conversation_id": "1725856982165590403", "edit_history_tweet_ids": ["1726068368271380508"], "in_reply_to_user_id": "1506967922870132742"}, 
{"text": "あとはるな愛レベルのパス度なら混浴できる！ってルッキズムキツくない？？？wwトランス女性ってあれくらいフェミニンで可愛くないとダメなん？wつら〜(皮肉ですよねんのため)", "id": "1726067582061715456", "conversation_id": "1726067139583549524", "edit_history_tweet_ids": ["1726067582061715456"], "in_reply_to_user_id": "1449880180462264328"}, 
{"text": "@tani_oota でも辞めたくても辞めれなかったりするんでしょうね……😓\\n\\n本当皮肉ですね😢", "id": "1726058577213915279", "conversation_id": "1725880844735451301", "edit_history_tweet_ids": ["1726058577213915279"], "in_reply_to_user_id": "358139026"}, 
{"text": "@Yuzukawa_Ryo 少なくとも、自分の周りで宗教やってる人で幸せそうな方はいないですね、、\\n何か皮肉ですね", "id": "1726056462039056807", "conversation_id": "1725880844735451301", "edit_history_tweet_ids": ["1726056462039056807"], "in_reply_to_user_id": "865022120216088576"}, 
{"text": "@ca970008f4 @Kikisuzutyobi 対抗措置を示すどろこか、期限を設けるようなこともなく、「容赦なし」とか「優しかった日本はもういない」とか、、、皮肉ですよね？", "id": "1726054762322469175", "conversation_id": "1725424330719560060", "edit_history_tweet_ids": ["1726054762322469175"], "in_reply_to_user_id": "1575422874944700416"}, 
{"text": "創価学会の人にリツイートされたので発言意図を一応説明しておくと「口先だけはご立派ですね」という皮肉です", "id": "1726052039204213190", "conversation_id": "1726050396693766653", "edit_history_tweet_ids": ["1726052039204213190"], "in_reply_to_user_id": "833039118"}, 
{"text": "@hinatosuzu おはようご…\\nあれ？雛子さん🔐付…\\n\\n私も全く同じこと思いました😔\\n彼も1人の人ですから、理解し 合える相手と縁あって一緒になれたのを無謀で過剰な取材に傷つけられ、人生変わるほどの選択を強いられるなら\\n海外移住がよかったかな…と\\n彼を支えた方々や土地への感謝が足を引っ張るなんて皮肉ですよ", "id": "1726037837630615807", "conversation_id": "1725652091941871966", "edit_history_tweet_ids": ["1726037837630615807"], "in_reply_to_user_id": "560122697"}, 
{"text": "@oosakahaoosaka 維新に言うたらつぶしてくれよるかもね \\n\\n維新はつぶすの大好きやし、公営事業大嫌い\\n\\n 皮肉です", "id": "1726036711002734787", "conversation_id": "1726034329703477305", "edit_history_tweet_ids": ["1726036711002734787"], "in_reply_to_user_id": "395588490"}, 
{"text": "@S_Satoshi_3 ある意味、偉大・・・\\nもちろん皮肉ですよ😂", "id": "1726021350752673970", "conversation_id": "1725756648726347789", "edit_history_tweet_ids": ["1726021350752673970"], "in_reply_to_user_id": "134778831"}, 
{"text": "確かに働くことを生きがいにしてる人もいてるかもしれないけどみんながそうではないだろうにね。\\nゆかり「まあそうですね。」\\n北欧の社会福祉制度見習うべきだろう。よく見かける税金のあの皮肉好き。\\nゆかり「皮肉ですか。」\\n働いたら罰金、家持ったら罰金、住んだら罰金、車持ったら罰金みたいなの。", "id": "1726020085897478148", "conversation_id": "1726020082130997412", "edit_history_tweet_ids": ["1726020085897478148"], "in_reply_to_user_id": "1236924080734912512"}, 
{"text": "@Y8dSJ35xqFlrOHw なんか、カネの流れというか、構造というかが実にシンプルで分かりやすい‼(当然皮肉ですが…)\\nきっとそのシステムに組み込まれてるこうした連中ってのは、頭の中のもメチャクチャシンプルな構造なの に違いないと確信しています。", "id": "1725931641074540756", "conversation_id": "1725835075848425472", "edit_history_tweet_ids": ["1725931641074540756"], "in_reply_to_user_id": "1575078991362662401"}, 
{"text": "@kojiskojis 不思議と「死去」しちゃうパレスチナ人ですね。\\nなんか75年前からこういう原因不明な「死去」が多発してるんですよね。\\n空気が悪いのか水が悪いのか。\\n\\n※皮肉です。", "id": "1725885603072577758", "conversation_id": "1725774706069118977", "edit_history_tweet_ids": ["1725885603072577758"], "in_reply_to_user_id": "91727675"}, 
{"text": "事実と皮肉です。", "id": "1725881679724863527", "conversation_id": "1725878298071502964", "edit_history_tweet_ids": ["1725881679724863527"], "in_reply_to_user_id": "1227190950763487234"}, 
{"text": "@pchip3 まさに皮肉ですね😅", "id": "1725872029432418418", "conversation_id": "1725764684572467542", "edit_history_tweet_ids": ["1725872029432418418"], "in_reply_to_user_id": "2305053535"}, 
{"text": "@nyappiripiri ごめんなさい、ちょっとした皮肉です。政治は変えねばなりません。その通りです。", "id": "1725860538083877197", "conversation_id": "1725823639361319412", "edit_history_tweet_ids": ["1725860538083877197"], "in_reply_to_user_id": "2992955666"}, 
{"text": "@aikonnor 人生はエスプリやー！皮肉です！", "id": "1725859500035539122", "conversation_id": "1725542971242873048", "edit_history_tweet_ids": ["1725859500035539122"], "in_reply_to_user_id": "93415727"}, 
{"text": "一応言っておくと、皮肉です。\\n販売の仕方をよくよくよくよくよく、考えてほしいです。\\n転売非推奨と見せかけて転売推奨(転売大歓迎してる現状をどうにかしてください。\\nお願いします。", "id": "1725854722345828369", "conversation_id": "1725848990451675272", "edit_history_tweet_ids": ["1725854722345828369"], "in_reply_to_user_id": "1675901437145149440"}, 
{"text": "@yosi_439 皮肉ですよね。\\nでももう一歩踏み込んで『抗議』だと思います。", "id": "1725851485576335469", "conversation_id": "1725849252566552902", "edit_history_tweet_ids": ["1725851485576335469"], "in_reply_to_user_id": "1440684402330066954"}
]


}

"""

# JSONデータをパース
data = json.loads(json_data)


# def extract_values_with_key(data, target_key):
#     values = []
#     if isinstance(data, dict):
#         for k, v in data.items():
#             if k == target_key:
#                 values.append(v)
#             elif isinstance(v, (dict, list)):
#                 values.extend(extract_values_with_key(v, target_key))
#     elif isinstance(data, list):
#         for item in data:
#             values.extend(extract_values_with_key(item, target_key))
#     return values


# # 特定のキーを含むデータ全体を集める
# target_key = "conversation_id"  # 例として指定したキー
# collected_result = extract_values_with_key(data, target_key)
# print(json.dumps(collected_result, indent=2))

def extract_values_with_keys(data, target_keys):
    values = []
    if isinstance(data, dict):
        item_values = []
        for k, v in data.items():
            if k in target_keys:
                item_values.append(v)
            elif isinstance(v, (dict, list)):
                item_values.extend(extract_values_with_keys(v, target_keys))
        if item_values:
            values.append(item_values)
    elif isinstance(data, list):
        for item in data:
            values.extend(extract_values_with_keys(item, target_keys))
    return values


# 特定のキーを含むデータ全体を集める
target_keys = ["conversation_id", "id"]  # 例として指定したキー(会話idとツイートid)
collected_result = extract_values_with_keys(data, target_keys)
print(json.dumps(collected_result, indent=2))
